# Data Programming in Python | BAIS:6040
# Files and External Data Sources - Exercise Solutions

## Importing modules

In [2]:
import json                            # handling JSON files
import sqlite3 as sq3                  # communicating with SQLite3 database
import os                              # using OS-dependent functionality 
import pandas as pd                    # handling Pandas dataframes
from seaborn import load_dataset       # using the Titanic dataset

## Exercises for file writing and reading (6 questions)

1\. Creat a list <i>l</i> of integers from 1 (inclusive) to 100 (inclusive). Write a CSV file named <i>ex_output.csv</i> under the directory <i>data</i>. The file contains only one column name <i>id</i> in the first row and, starting from the second row, each number from <i>l</i> in each line.

In [ ]:
# Your answer here
l = range(1, 101)
with open("data/ex_output.csv", mode="w") as fw:
    fw.write("id\n")
    for num in l:
        fw.write("{}\n".format(num))

2\. Continue to use the list <i>l</i>. Write another CSV file named <i>ex_output2.csv</i> under the directory <i>data</i>. The file contains three column names <i>id</i>, <i>square</i>, and <i>cube</i> in the first row and, starting from the second row, each number from <i>l</i>, its square, and its cube in each line. The delimiter between columns is a comma.

In [ ]:
# Your answer here
with open("data/ex_output2.csv", mode="w") as fw:
    fw.write("id,square,cube\n")
    for num in l:
        fw.write("{},{},{}\n".format(num, num**2, num**3))

Let's continue to use the dataframe <i>df</i> from the Titanic dataset.

In [ ]:
df = load_dataset("titanic")
df.head()

3\. Create a CSV file named <i>ex_titanic.csv</i> under the directory <i>data</i>. The file contains three column names <i>sex</i>, <i>pclass</i> and <i>embark_town</i> in the first row and the values from the corresponding columns of <i>df</i> in the following rows. The delimiter between columns is a tab.

In [ ]:
# Your answer here
with open("data/ex_titanic.csv", mode="w") as fw:
    fw.write("sex\tclass\tembark_town\n")
    
    for idx, val in df.iterrows():
        sex = val.sex
        pclass = val.pclass
        town = val.embark_town
        
        fw.write("{}\t{}\t{}\n".format(sex, pclass, town))

4\. Create a CSV file named <i>ex_titanic2.csv</i> under the directory <i>data</i>. The file contains the same contents as <i>ex_titanic.csv</i>. In addition, it contains another column named <i>num_fam_mems</i>, meaning the number of family members, which is the sum of the column <i>sibsp</i> (siblings and spouses) and the column <i>parch</i> (parents and children).

In [ ]:
# Your answer here
with open("data/ex_titanic2.csv", mode="w") as fw:
    fw.write("sex\tpclass\tembark_town\tnum_fam_mems\n")
    
    for idx, val in df.iterrows():
        sex = val.sex
        pclass = val.pclass
        town = val.embark_town
        num_fam_mems = val.sibsp + val.parch
        
        fw.write("{}\t{}\t{}\t{}\n".format(sex, pclass, town, num_fam_mems))

5\. Read the file <i>ex_titanic2.csv</i> under the directory <i>data</i> and print the first five rows as they are.

In [ ]:
# Your answer here
with open("data/ex_titanic2.csv", mode="r") as fr:
    lines = fr.readlines()
    for line in lines[:5]:
        print(line, end="")

6\. Read the file <i>ex_titanic2.csv</i> under the directory <i>data</i> and print the first five rows under the column <i>embark_town</i>.

In [ ]:
# Your answer here
with open("data/ex_titanic2.csv", mode="r") as fr:
    lines = fr.readlines()
    for line in lines[:5]:
        _, _, town, _ = line.split("\t")
        print(town)

## Exercises for JSON file writing and reading (3 questions)

Let's continue to use the dataframe <i>df</i> from the Titanic dataset.

In [7]:
df = load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

1\. Create a list <i>passengers</i>, in which each element is a dictionary with the keys being <i>sex</i>, <i>pclass</i>, and <i>embark_town</i> and the values being their corresponding values in <i>df</i>.

In [10]:
# Your answer here
passengers = []

for idx, val in df.iterrows():
    sex = val.sex
    pclass = val.pclass
    town = val.embark_town
    
    passenger = {"sex": sex, "pclass": pclass, "town": town}
    passengers.append(passenger)
    
passengers[:5]

[{'sex': 'male', 'pclass': 3, 'town': 'Southampton'},
 {'sex': 'female', 'pclass': 1, 'town': 'Cherbourg'},
 {'sex': 'female', 'pclass': 3, 'town': 'Southampton'},
 {'sex': 'female', 'pclass': 1, 'town': 'Southampton'},
 {'sex': 'male', 'pclass': 3, 'town': 'Southampton'}]

2\. Serialize <i>passengers</i> as a JSON formatted stream to a file named <i>ex_passengers.json</i> under the directory <i>data</i>.

In [ ]:
# Your answer here
with open("data/ex_passengers.json", "w") as fw:
    json.dump(passengers, fw)

3\. Deserialize the <i>ex_passengers.json</i> file under the directory <i>data</i> to a Python list named <i>passengers_new</i>.

In [ ]:
# Your answer here
with open("data/ex_passengers.json", "r") as fr:
    passengers_new = json.load(fr)
    
passengers_new[:5]